#language: ru
Функционал: Интернет-магазин Ozon

  Сценарий: Сценарий №1

    * Закрываем всплывающее окно
    * Выполняем поиск по наименованию: iphone
    * Ограничиваем цену до 100000₽
    * Отмечаем чекбоксы
      |Высокий рейтинг|
      |3 ГБ|
    * Добавляем в корзину первые 7 нечетных товаров
    * Переходим в корзину
    * Проверяем, что все добавленные ранее товары находятся в корзине
    * Проверяем, что отображается текст «Ваша корзина - 7 товаров»
    * Удаляем все товары из корзины
    * Проверяем, что корзина не содержит никаких товаров
    * Список добавленных товаров


  Сценарий: Сценарий №2

    * Закрываем всплывающее окно
    * Выполняем поиск по наименованию: беспроводные наушники
    * Ограничиваем цену до 10000₽
    * Нажимаем кнопку посмотреть все бренды
    * Отмечаем чекбоксы
      |Beats|
      |Samsung|
      |Высокий рейтинг|
    * Добавляем в корзину все четные товары
    * Переходим в корзину
    * Проверяем, что все добавленные ранее товары находятся в корзине
    * Удаляем все товары из корзины
    * Проверяем, что корзина не содержит никаких товаров
    * Список добавленных товаров


